app/interactions/create_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sanmit@mail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_hash", "created_at", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?, ?)
---
    def execute_transaction_code
        user = User.find_by_email(self.email)

        if user.present?
            self.errors.add(:user, "already exists")
            return
        end

        user = User.new(get_params)

        unless user.save!