app/interactions/create_quotation.rb

INSERT INTO "quotations" ("user_id", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def execute_transaction_code
        quote = Quotation.new(get_params)

        unless quote.save!