app/interactions/get_session.rb

    def execute
        session = UserSession.find(self.id)

        if session.expiry_at < Time.zone.now
            self.errors.add(:session, "is expired")
            return
        end

        return User.find(session.user_id).slice(:name, :id, :email)
---
SELECT "user_sessions".* FROM "user_sessions" WHERE "user_sessions"."id" = ? LIMIT ?  [["id", "12662092-5f01-4048-968c-3d2702edad2b"], ["LIMIT", 1]]
SELECT "user_sessions".* FROM "user_sessions" WHERE "user_sessions"."id" = ? LIMIT ?  [["id", "6e29e97f-9475-44c6-805b-f72cb1a4f61f"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", "d284c8ab-63fc-45c6-bc44-7366411cb9c2"], ["LIMIT", 1]]