app/interactions/list_quotations.rb

    def execute
        quotations = Quotation.includes(:user)

        quotations = quotations.where('updated_at >= ?', self.created_at_greater_than) if self.created_at_greater_than.present?

        quotations = quotations.where(user_id: self.user_id) if self.user_id.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", "f072e58a-adf2-4216-aade-48961751b963"], ["id", "d284c8ab-63fc-45c6-bc44-7366411cb9c2"]]
SELECT "quotations".* FROM "quotations" WHERE (name ilike '%%')
SELECT "quotations".* FROM "quotations" WHERE "quotations"."user_id" = ?  [["user_id", "8dd2cb3a-6827-4770-83da-cc846f8a08ba"]]