app/interactions/list_quotations.rb

    def execute
        { list: Quotation.includes(:user).as_json(include: { user: { only: [:id, :name, :email] } } ) }
---
SELECT "users"."id", "users"."name", "users"."email" FROM "users" WHERE (name ilike '%%')