app/interactions/list_users.rb

    def execute
        users = User.where('name ilike ?', "%%").select(:id, :name, :email)

        users = users.where(user_type: self.user_type) if self.user_type.present?
---
SELECT "users"."id", "users"."name", "users"."email" FROM "users" WHERE (name ilike '%%')
SELECT "users"."id", "users"."name", "users"."email" FROM "users" WHERE (name ilike '%%') AND "users"."user_type" = ?  [["user_type", "customer"]]