app/interactions/login_user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "san@mail.com"], ["LIMIT", 1]]
INSERT INTO "user_sessions" ("user_id", "expiry_at", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "d284c8ab-63fc-45c6-bc44-7366411cb9c2"], ["expiry_at", 2024-01-05 07:57:31 UTC], ["created_at", 2024-01-04 07:57:32 UTC], ["updated_at", 2024-01-04 07:57:32 UTC]]
---
    def execute_transaction_code
        user = User.find_by_email(self.email)

        if user.nil?
            self.errors.add(:user, "does not exist")
            return
        end

        password_correct = user.authenticate(self.password)

        if !password_correct
            self.errors.add(:password, "is not correct")
            return
        end

        session = UserSession.new({
            user_id: user.id,
            expiry_at: Time.zone.now + 1.day
         })

        unless session.save!