app/interactions/update_quotation.rb

    def execute_transaction_code
        quote = Quotation.find(self.id)

        quote.assign_attributes(get_params)

        unless quote.save!
---
SELECT "quotations".* FROM "quotations" WHERE "quotations"."id" = ? LIMIT ?  [["id", "637c7afa-b6fb-4a4b-9f4b-540765b27f47"], ["LIMIT", 1]]
UPDATE "quotations" SET "url" = ?, "updated_at" = ? WHERE "quotations"."id" = ?  [["url", "http://localhost:3000/uploads/d2dfafda00b042fdb4f4/index.html"], ["updated_at", 2024-01-04 11:55:34 UTC], ["id", "637c7afa-b6fb-4a4b-9f4b-540765b27f47"]]